backend/xmlFiles/FetchTestSuites.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <FetchTestSuites xmlns="http://schemas.microsoft.com/TeamFoundation/2007/02/TCM/TestResults/01">
      <teamProjectName>projectName</teamProjectName>
      <suiteIds>
        <IdAndRev Id="int" />
      </suiteIds>
    </FetchTestSuites>
  </soap12:Body>
</soap12:Envelope>